### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_eks_node_group.managed_ng has changed
!   resource "aws_eks_node_group" "managed_ng" {
        id                     = "jingood2-dev-eks:general-20230413031132081800000007"
+       labels                 = {}
        tags                   = {
            "Name"                                       = "jingood2-dev-eks-general"
            "environment"                                = "dev"
            "k8s.io/cluster-autoscaler/enabled"          = "TRUE"
            "k8s.io/cluster-autoscaler/jingood2-dev-eks" = "owned"
            "kubernetes.io/cluster/jingood2-dev-eks"     = "owned"
            "managed-by"                                 = "terraform-aws-eks-blueprints"
            "owners"                                     = "jingood2"
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].aws_eks_addon.aws_ebs_csi_driver[0] will be created
+   resource "aws_eks_addon" "aws_ebs_csi_driver" {
+       addon_name               = "aws-ebs-csi-driver"
+       addon_version            = "v1.17.0-eksbuild.1"
+       arn                      = (known after apply)
+       cluster_name             = "jingood2-dev-eks"
+       configuration_values     = (known after apply)
+       created_at               = (known after apply)
+       id                       = (known after apply)
+       modified_at              = (known after apply)
+       preserve                 = true
+       resolve_conflicts        = "OVERWRITE"
+       service_account_role_arn = (known after apply)
+       tags_all                 = (known after apply)
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].aws_iam_policy.aws_ebs_csi_driver[0] will be created
+   resource "aws_iam_policy" "aws_ebs_csi_driver" {
+       arn         = (known after apply)
+       description = "IAM Policy for AWS EBS CSI Driver"
+       id          = (known after apply)
+       name        = "jingood2-dev-eks-aws-ebs-csi-driver-irsa"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ec2:ModifyVolume",
+                           "ec2:DetachVolume",
+                           "ec2:DescribeVolumesModifications",
+                           "ec2:DescribeVolumes",
+                           "ec2:DescribeTags",
+                           "ec2:DescribeSnapshots",
+                           "ec2:DescribeInstances",
+                           "ec2:DescribeAvailabilityZones",
+                           "ec2:CreateSnapshot",
+                           "ec2:AttachVolume",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = ""
                    },
+                   {
+                       Action    = "ec2:CreateTags"
+                       Condition = {
+                           StringEquals = {
+                               "ec2:CreateAction" = [
+                                   "CreateVolume",
+                                   "CreateSnapshot",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
+                       Sid       = ""
                    },
+                   {
+                       Action   = "ec2:DeleteTags"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
+                       Sid      = ""
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].module.irsa_addon[0].aws_iam_role.irsa[0] will be created
+   resource "aws_iam_role" "irsa" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringLike = {
+                               "oidc.eks.us-east-1.amazonaws.com/id/226AC3B8497FDABD5F19766D997CA0E2:aud" = "sts.amazonaws.com"
+                               "oidc.eks.us-east-1.amazonaws.com/id/226AC3B8497FDABD5F19766D997CA0E2:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::484752921218:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/226AC3B8497FDABD5F19766D997CA0E2"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "AWS IAM Role for the Kubernetes service account ebs-csi-controller-sa."
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "jingood2-dev-eks-ebs-csi-controller-sa-irsa"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].module.irsa_addon[0].aws_iam_role_policy_attachment.irsa[0] will be created
+   resource "aws_iam_role_policy_attachment" "irsa" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "jingood2-dev-eks-ebs-csi-controller-sa-irsa"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>